In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(101)
mydata = np.random.randint(0,101,(4,3))

In [3]:
mydata

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [4]:
myindex = ['cA','NY','AZ','TX']

In [5]:
mycolumns = ['Jan', 'Fab', 'Mar']

In [7]:
df = pd.DataFrame(mydata)

In [8]:
df

    0   1   2
0  95  11  81
1  70  63  87
2  75   9  77
3  40   4  63

In [11]:
df = pd.DataFrame(data=mydata,index=myindex)

In [12]:
df

     0   1   2
cA  95  11  81
NY  70  63  87
AZ  75   9  77
TX  40   4  63

In [13]:
df = pd.DataFrame(data=mydata,index=myindex, columns=mycolumns)

In [14]:
df

    Jan  Fab  Mar
cA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, cA to TX
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Jan     4 non-null      int32
 1   Fab     4 non-null      int32
 2   Mar     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

In [16]:
pwd

'C:\\Users\\Saeid'

In [17]:
ls

 Volume in drive C is OS
 Volume Serial Number is 0AF4-013E

 Directory of C:\Users\Saeid

2023-01-10  09:16 PM    <DIR>          .
2022-09-28  05:02 PM    <DIR>          ..
2023-01-02  05:59 PM    <DIR>          .anaconda
2023-01-10  09:16 PM    <DIR>          .conda
2023-01-02  08:03 PM                43 .condarc
2022-08-25  07:04 PM    <DIR>          .config
2023-01-02  08:54 PM    <DIR>          .continuum
2023-01-10  08:14 PM    <DIR>          .ipynb_checkpoints
2021-10-22  12:17 PM    <DIR>          .ipython
2022-08-30  11:06 AM    <DIR>          .jssc
2023-01-10  06:14 PM    <DIR>          .jupyter
2022-08-22  11:15 AM    <DIR>          .matplotlib
2022-08-31  09:49 AM    <DIR>          .ms-ad
2022-11-02  02:45 PM    <DIR>          .VirtualBox
2022-08-31  10:46 AM    <DIR>          .vscode
2023-01-04  09:12 PM            15,241 1-numpy.ipynb
2021-08-01  04:43 PM    <DIR>          3D Objects
2023-01-02  09:35 PM    <DIR>          anaconda3
2022-08-22  11:04 AM    <DIR>          ansel
2022-09-28  05:09 PM    <DIR>          Contacts
2022-08-30  07:12 PM    <DIR>          Documents
2023-01-09  12:33 PM    <DIR>          Downloads
2022-08-30  08:00 PM        65,538,032 edb_languagepack.exe
2022-08-30  08:00 PM        16,215,072 edb_mtk.exe
2022-08-30  08:00 PM        12,870,368 edb_npgsql.exe
2022-08-30  08:00 PM        20,743,560 edb_pem_agent.exe
2022-08-30  08:00 PM        20,127,184 edb_psqlodbc.exe
2022-08-30  08:01 PM        73,263,936 edb_xdb_62.exe
2022-09-28  05:09 PM    <DIR>          Favorites
2022-09-28  05:09 PM    <DIR>          Links
2022-08-26  11:14 AM            32,637 Market_portfolio_analysis.ipynb
2022-09-28  05:09 PM    <DIR>          Music
2022-12-27  06:04 PM    <DIR>          OneDrive
2022-08-30  08:01 PM        80,087,808 pemhttpd.exe
2022-08-30  08:05 PM        35,655,523 postgis_3_1_pg14.exe
2022-08-30  08:05 PM       174,149,824 postgresql_10.exe
2022-07-18  06:10 PM    <DIR>          Postman
2022-09-28  05:09 PM    <DIR>          Saved Games
2022-08-23  07:02 PM    <DIR>          scikit_learn_data
2022-03-08  07:47 PM    <DIR>          seaborn-data
2022-09-28  05:09 PM    <DIR>          Searches
2021-09-03  08:19 AM    <DIR>          source
2021-04-29  04:51 PM    <DIR>          Tracing
2022-10-24  02:23 PM             7,077 Untitled.ipynb
2023-01-02  08:01 PM             1,206 Untitled1.ipynb
2023-01-02  08:02 PM                72 Untitled2.ipynb
2023-01-02  09:00 PM                72 Untitled3.ipynb
2023-01-02  09:27 PM               941 Untitled4.ipynb
2023-01-02  09:46 PM                72 Untitled5.ipynb
2023-01-03  11:23 PM             1,436 Untitled6.ipynb
2023-01-10  09:16 PM             8,997 Untitled7.ipynb
2022-09-28  05:09 PM    <DIR>          Videos
2022-10-12  11:29 AM    <DIR>          VirtualBox VMs
              20 File(s)    498,719,101 bytes
              33 Dir(s)  74,351,472,640 bytes free

In [19]:
df = pd.read_csv('C:\\Users\\Saeid\\OneDrive\\Desktop\\tips.csv')

In [20]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672